# Data Manipulation and analysis with Pandas

Data Manipulation and Analysis are two intertwined phases in data science: Manipulation cleans, transforms, and structures raw data (e.g., filtering, joining, correcting errors) into a usable format, while Analysis interprets this prepared data to find patterns, extract insights, and support decisions,

In [1]:
# import
import pandas as pd

In [2]:
df=pd.read_csv('data.csv')

In [3]:
# Fetch first 5 rows
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [4]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [5]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [6]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [7]:
df.isnull()

     Date  Category  Value  Product  Sales  Region
0   False     False  False    False  False   False
1   False     False  False    False  False   False
2   False     False  False    False  False   False
3   False     False  False    False  False   False
4   False     False  False    False  False   False
5   False     False  False    False  False   False
6   False     False  False    False  False   False
7   False     False  False    False  False   False
8   False     False  False    False  False   False
9   False     False  False    False  False   False
10  False     False  False    False  False   False
11  False     False  False    False   True   False
12  False     False  False    False  False   False
13  False     False  False    False  False   False
14  False     False  False    False  False   False
15  False     False   True    False  False   False
16  False     False  False    False  False   False
17  False     False   True    False  False   False
18  False     False  False    False  False   False
19  False     False  False    False  False   False
20  False     False  False    False  False   False
21  False     False  False    False  False   False
22  False     False  False    False  False   False
23  False     False  False    False  False   False
24  False     False  False    False  False   False
25  False     False  False    False  False   False
26  False     False  False    False  False   False
27  False     False  False    False  False   False
28  False     False   True    False  False   False
29  False     False  False    False  False   False
30  False     False  False    False  False   False
31  False     False  False    False  False   False
32  False     False  False    False  False   False
33  False     False  False    False   True   False
34  False     False  False    False  False   False
35  False     False  False    False   True   False
36  False     False  False    False  False   False
37  False     False  False    False   True   False
38  False     False  False    False  False   False
39  False     False  False    False  False   False
40  False     False  False    False  False   False
41  False     False  False    False  False   False
42  False     False  False    False  False   False
43  False     False  False    False  False   False
44  False     False  False    False  False   False
45  False     False  False    False  False   False
46  False     False  False    False  False   False
47  False     False  False    False  False   False
48  False     False  False    False  False   False
49  False     False  False    False  False   False

In [8]:
df.isnull().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28     True
29    False
30    False
31    False
32    False
33     True
34    False
35     True
36    False
37     True
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool

In [9]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [10]:
# fill null with zero
df_filled=df.fillna(0)

In [11]:
df_filled.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [12]:
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [13]:
df['Sales'].mean()

np.float64(557.1304347826087)

In [14]:
# fill missing value with mean 
df['Sales_filled'] =df['Sales'].fillna(df['Sales'].mean())

In [15]:
df.head()

         Date Category  Value   Product  Sales Region  Sales_filled
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [16]:
df.isnull().sum()

Date            0
Category        0
Value           3
Product         0
Sales           4
Region          0
Sales_filled    0
dtype: int64

In [17]:
# Renaming column
df=df.rename(columns={'Date': 'Sales_Date'})

In [18]:
df.head()

   Sales_Date Category  Value   Product  Sales Region  Sales_filled
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [19]:
df.dtypes

Sales_Date       object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_filled    float64
dtype: object

In [20]:
df['New_value'] =df['Value'].fillna(df['Value'].mean()).astype(int)

In [21]:
df.head()

   Sales_Date Category  Value   Product  Sales Region  Sales_filled  New_value
0  2023-01-01        A   28.0  Product1  754.0   East         754.0         28
1  2023-01-02        B   39.0  Product3  110.0  North         110.0         39
2  2023-01-03        C   32.0  Product2  398.0   East         398.0         32
3  2023-01-04        B    8.0  Product1  522.0   East         522.0          8
4  2023-01-05        B   26.0  Product3  869.0  North         869.0         26

In [22]:
df.isnull().sum()

Sales_Date      0
Category        0
Value           3
Product         0
Sales           4
Region          0
Sales_filled    0
New_value       0
dtype: int64

In [23]:
# Lamba funtion apply
df['twise_value']=df['New_value'].apply(lambda x:x*2)

In [24]:
df.head()

,Sales_Date,Category,Value,Product,Sales,Region,Sales_filled,New_value,twise_value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52

# Data aggregation and grouping

Data aggregation and grouping are core data analysis techniques used to summarize large datasets by dividing them into subsets (groups) based on shared characteristics, then applying functions (like sum, count, average) to each group to reveal patterns, trends, and insights,

In [27]:
df.head()

,Sales_Date,Category,Value,Product,Sales,Region,Sales_filled,New_value,twise_value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52

In [28]:
group_mean= df.groupby('Product')['Value'].mean()
group_mean

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [29]:
df.groupby('Product')['Sales'].mean()

Product
Product1    574.866667
Product2    567.230769
Product3    535.055556
Name: Sales, dtype: float64

In [30]:
df.groupby(['Product','Region'])['Value'].sum()

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [32]:
df.groupby(['Product','Region'])['Value'].mean()

Product   Region
Product1  East      41.714286
          North      4.500000
          South     50.000000
          West      82.000000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     40.600000
          South     71.666667
          West      62.166667
Name: Value, dtype: float64

In [33]:
# Multiple unction apply
df.groupby('Region')['Value'].agg(['mean','sum','count'])

             mean     sum  count
Region
East    42.307692   550.0     13
North   37.666667   339.0      9
South   62.000000   496.0      8
West    61.588235  1047.0     17

# Merging and Joining operation

In [37]:
df1=pd.DataFrame({'key':['A','B','C'],'value1':[12,13,14]})
df2=pd.DataFrame({'key':['A','B','D'],'value2':[1,3,4]})

In [38]:
df1

  key  value1
0   A      12
1   B      13
2   C      14

In [39]:
df2

  key  value2
0   A       1
1   B       3
2   D       4

In [40]:
# merge based on key Column
pd.merge(df1,df2,on='key',how='inner')

  key  value1  value2
0   A      12       1
1   B      13       3

In [41]:
pd.merge(df1,df2,on='key',how='outer')

  key  value1  value2
0   A    12.0     1.0
1   B    13.0     3.0
2   C    14.0     NaN
3   D     NaN     4.0

In [43]:
df1

  key  value1
0   A      12
1   B      13
2   C      14

In [44]:
df2

  key  value2
0   A       1
1   B       3
2   D       4

In [42]:
pd.merge(df1,df2,on='key',how='left')

  key  value1  value2
0   A      12     1.0
1   B      13     3.0
2   C      14     NaN

In [45]:
pd.merge(df1,df2,on='key',how='right')

  key  value1  value2
0   A    12.0       1
1   B    13.0       3
2   D     NaN       4